If true, legend is shown in the view.
  Namespace:   Autodesk.Revit.DB.Analysis
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public bool ShowLegend { get; set; }
  Visual Basic
Public Property ShowLegend As Boolean
	Get
	Set
  Visual C++
public:
property bool ShowLegend {
	bool get ();
	void set (bool value);
}
 See Also
  AnalysisDisplayLegendSettings Class
  Autodesk.Revit.DB.Analysis Namespace